""""
Напишите функцию is_prime(num), которая принимает в качестве аргумента натуральное число и возвращает значение True если число является простым и False в противном случае.

 Примечание. Следующий программный код:

print(is_prime(1))
print(is_prime(10))
print(is_prime(17))
должен выводить:

False
False
True
"""
# -------------------------------------------------------------------------------------------------

# 1)вариант

def is_prime(num):
    total=0
    for i in range(1,num+1):
        if num%i==0:
            total+=1
    if total==2:
        return True
    else:
        return False

n = int(input())

print(is_prime(n))
# -------------------------------------------------------------------------------------------------

# 2)вариант

def is_prime(num):
    return len([i for i in range(1, num+1) if num % i == 0]) == 2

n = int(input())

print(is_prime(n))
# -------------------------------------------------------------------------------------------------

# 3)вариант

def is_prime(num):
    return 2 in [num, 2**num%num]
# Примечание: результат математической операции 2**N%N всегда = 2, если N - простое число и N != 2

n = int(input())


print(is_prime(n))