""""
Середина отрезка
Напишите функцию get_middle_point(x1, y1, x2, y2),
 которая принимает в качестве аргументов координаты концов отрезка
 (x_1; \, y_1)(x 1;y1) и (x_2; \, y_2)(x2;y2)
 и возвращает координаты точки являющейся серединой данного отрезка.
"""
# -------------------------------------------------------------------------------------------------

# 1)вариант

def get_middle_point(x1, y1, x2, y2):
    return (x1+x2)/2, (y1+y2)/2

x_1, y_1 = int(input()), int(input())
x_2, y_2 = int(input()), int(input())

x, y = get_middle_point(x_1, y_1, x_2, y_2)
print(x, y)
# -------------------------------------------------------------------------------------------------

# 2)вариант

def get_middle_point(x1, y1, x2, y2):
    return (x1 + x2) / 2, (y1 + y2) / 2

print(*get_middle_point(int(input()), int(input()), int(input()), int(input())))
