"""Сумма цифр
Напишите функцию print_digit_sum(),
которая принимает одно целое число num и выводит на печать сумму его цифр."""


# ----------------------------------------------------------------------------------------

# 1) вариант

# объявление функции
def print_digit_sum(num):
    total = 0
    for i in range(len(n)):
        total += int(n[i])
    print(total)


# считываем данные
n = input()

# вызываем функцию
print_digit_sum(n)

# ----------------------------------------------------------------------------------------


# 2) вариант

def print_digit_sum(num):
    print(sum(int(i) for i in str(num)))


n = int(input())

print_digit_sum(n)
# ----------------------------------------------------------------------------------------


# 3) вариант
# объявление функции
def print_digit_sum(n):
    c=0
    while n!=0:
        b=n%10
        c+=b
        n=n//10
    print(c)


# считываем данные
n = int(input())

# вызываем функцию
print_digit_sum(n)