"""
Палиндром
На вход программе подается одно слово, записанное в нижнем регистре. Напишите программу, которая определяет является ли оно палиндромом.

Формат входных данных
На вход программе подается одно слово в нижнем регистре.

Формат выходных данных
Программа должна вывести «YES», если слово является палиндромом и «NO» в противном случае.

Примечание. Палиндром читается одинаково в обоих направлениях, например слово «потоп».

Sample Input 1:

потоп
Sample Output 1:

YES
Sample Input 2:

анекдот
Sample Output 2:

NO
"""
# -------------------------------------------------------------------------------------------------

# 1)вариант
stroka = input()
flag = False
for i in range(1, len(stroka) + 1):
    if stroka[i - 1] == stroka[-i]:
        flag = True
    else:
        flag = False
if flag == True:
    print('YES')
else:
    print('NO')
# -------------------------------------------------------------------------------------------------

# 2)вариант
s = input()
if s == s[::-1]:
    print('YES')
else:
    print('NO')