"""
Напишите программу определяющую евклидово расстояние между двумя точками, координаты которых заданы.

Формат входных данных
На вход программе подается четыре вещественных числа, каждое на отдельной строке – x_{1}, \, y_{1}, \, x_{2}, \, y_{2}x
1
​
 ,y
1
​
 ,x
2
​
 ,y
2
​
 ​.

Формат выходных данных
Программа должна вывести одно число – евклидово расстояние.

Sample Input 1:

2.0
2.5
44.155
100.50
Sample Output 1:

106.68197610187018
Sample Input 2:

5.5
2.4
4.9
6.3
Sample Output 2:

3.9458839313897713
Sample Input 3:

150.0
100.0
50.0
10.0
Sample Output 3:

134.5362404707371
"""
# -------------------------------------------------------------------------------------------------

# 1)вариант
from math import *

x1 = float(input())
y1 = float(input())
x2 = float(input())
y2 = float(input())
s = sqrt((x1 - x2) ** 2 + (y1 - y2) ** 2)
print(s)
# -------------------------------------------------------------------------------------------------

# 2)вариант
from math import *

x1, y1, x2, y2 = float(input()), float(input()), float(input()), float(input())
q = pow(x1 - x2, 2)
w = pow(y1 - y2, 2)
p = sqrt(q + w)
print(p)
