"""
Какова функция/предназначение отрицательного индекса?
Любые последовательности в Python проиндексированы,
и они состоят как из положительных индексов, так и
из отрицательных. Индексация положительных чисел
начинается с ‘0’, то есть первый элемент ‘0’, а второй ‘1’
и так далее. Индексация отрицательных чисел начинается с ‘-1’,
этот индекс обозначает последний элемент в последовательности,
а ‘-2’ обозначает предпоследний элемент, и далее индексация
идет вперед по аналогии с положительными числами.
Отрицательные индексы используются для того, чтобы
удалить лишние пробелы из строки, а также дать строке
возможность пропускать последний символ, который представлен,
как: S[:-1]. Также отрицательные индексы используются для того,
чтобы показать, что индексация в строке идет в правильном порядке.
"""