"""
Создайте класс Lion. В нем должен быть метод roar, который печатает на экран "Rrrrrrr!!!"

Пример работы с классом Lion

simba = Lion()
simba.roar() # печатает Rrrrrrr!!!
"""
# -------------------------------------------------------------------------------------------------

# 1)вариант
class Lion:
    @staticmethod
    def roar():
        print('Rrrrrrr!!!')

# -------------------------------------------------------------------------------------------------

# 2)вариант
class Lion:
    def roar(self):
        print('Rrrrrrr!!!')