"""
Делаем срезы 2
На вход программе подается одна строка. Напишите программу, которая выводит:

третий символ этой строки;
предпоследний символ этой строки;
первые пять символов этой строки;
всю строку, кроме последних двух символов;
все символы с четными индексами;
все символы с нечетными индексами;
все символы в обратном порядке;
все символы строки через один в обратном порядке, начиная с последнего.
Формат входных данных
На вход программе подается одна строка, длина которой больше 5 символов.

Формат выходных данных
Программа должна вывести данные в соответствии с условием. Каждое значение выводится на отдельной строке.

Sample Input:

abcdefghijklmnopqrstuvwxyz
Sample Output:

c
y
abcde
abcdefghijklmnopqrstuvwx
acegikmoqsuwy
bdfhjlnprtvxz
zyxwvutsrqponmlkjihgfedcba
zxvtrpnljhfdb
"""
# -------------------------------------------------------------------------------------------------

# 1)вариант
s = input()
print(s[2])
print(s[-2])
print(s[0:5])
print(s[:-2])
for i in range(len(s)):
    if i % 2 == 0:
        print(s[i], end="")
print()
for i in range(len(s)):
    if i % 2 != 0:
        print(s[i], end="")
print()
print(s[::-1])
print(s[::-2])
# -------------------------------------------------------------------------------------------------

# 2)вариант
s = input()
print(s[2])
print(s[-2:-1])
print(s[:5])
print(s[0:-2])
print(s[::2])
print(s[1::2])
print(s[::-1])
print(s[::-2])
